import Alert from "./Alert";

function AllAlerts() {
  return (
    <div className="container-lg space-y-4">
      <Alert
        type="success"
        title="عن الموقع"
        message={
          <ol className="list-decimal list-inside space-y-2">
            <li>
              يتم تحديث الطلبات باستمرار ويتم حذف الاستمارات للزيجات التى تمت
              بناء على طلب ولي الامر
            </li>
            <li>
              يمكن استخدام محرك البحث للوصول للمواصفات التى تريدها بكل يسر
            </li>
            <li>
              الموقع غير مسؤول عن اي استخدام للارقام الخاصة باولياء الامور وما
              هو الا وسيلة تيسير فقط
            </li>
            <li>
              كل الاستمارات المنشورة يتم مراجعتها بعناية حتي لا تتضمن اي معلومات
              خاطئة
            </li>
            <li>
              نرجو من اولياء الامور عند التسجيل ارسال تسجيل صوتي واضح حتي لا
              تتكبد عناء التسجيل مرة اخري
            </li>
            <li>كل البيانات المرسلة محمية ولا يمكن الافصاح عنها قبل النشر</li>
            <li>
              يتم العمل على اصدارات للموقع لجعله اكثر سهولة فى الاستخدام وسهل فى
              التصفح
            </li>
            <li>
              فى حال وجود اي شكاوي تتعلق بالموقع برجاء ارسال رسالة على البريد
              الالكتروني التالى:{" "}
              <a
                href="mailto:support@zwaj-islamy.com"
                className="text-yellow-400 font-bold hover:text-yellow-500"
              >
                support@zwaj-islamy.com
              </a>
            </li>
          </ol>
        }
        isOpen
      />
      <div className="flex flex-col sm:flex-row gap-4">
        <Alert
          title="تنوية هام جداً !"
          message="ان شاء الله اي عريس هيتجوز بالطريقة الشرعيه عن طريقي اتفاقنا كالاتي
            ان شاء الله هتطلع ١٠٠٠ جنيه صدقة لله لاحد الفقراء او المحتاجين انت
            تعرفه وتعطيه الفلوس بنفسك بنيه ان ربنا يباركلك في زوجتك ويرزقك منها
            ذرية طيبة حتي لو كل شهر هتتصدق بـ ١٠٠ جنيه بس لحد ما تخلص ال ١٠٠٠
            جنيه اللي عليك زي ما اتفقنا ونفس الكلام هيعمله كل ولي امر هتخرج ١٠٠٠
            جنيه لله بمعرفتك لاي فقير او محتاج او أرمله بتربي أيتام حتي لو ١٠٠
            جنيه كل شهر لو مش معاك تدفعهم مره واحده وده اتفاق بمجرد ان حضرتك
            تكلم ولي امر وتروحله وتخطب بنته انت كده وافقت عليه ونفس الكلام ده
            لولي الامر وعلشان محدش يكتبلي في التعليقات اني بلزم الناس بالصدقة
            اعتبر أن انا مكتب زواج ودي أتعابي وانا بقي بقولك طلعها لله بمعرفتك
            انت.. كَفَىٰ بِاللَّهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ."
        />
        <Alert
          title="تنبيه من عمليات الاحتيال !"
          message="يرجي العلم ان هناك بعض الاشخاص يقوم بانتحال صفة فريق عمل الموقع والتطبيق او انه احد اصدقاء عبد الكريم محمود ويبداء فى الاحتيال على اصحاب الاستمارات بحجة عمل استبيان او جمع معلومات عن المتصلين واشياء اخري لذا فريق العمل لا يتواصل مع احد فريق العمل يحذر من اي تعامل خارج الموقع او التطبيق من خلال صفحة اتصل بنا واضفنا ايضا بريد الكتروني ورقم واتساب للتواصل المباشر فى حال حدوث اي شىء ويمكن استخدام نموذج اتصل بنا لاستقبال استفساراتكم وقريبا سيكون نموذج اتصل بنا متاح عبر التطبيق النسخة ٢ الموقع غير مسؤول عن اي شخص يقوم بالتواصل مع اي من اصحاب الاستمارات ولذا وجب التنبيه."
        />
      </div>
    </div>
  );
}

export default AllAlerts;
